# External Services Built In External Services Geometry Augmentation Service Property

Source: https://www.revitapidocs.com/2026/79405586-d71a-d842-bc24-2ca45435abe8.htm

---

| External Services Built In External Services Geometry Augmentation Service Property |
| --- |

Autodesk Internal: The service where GeometryAugmentationServers can be registered.
**Namespace:** Autodesk.Revit.DB.ExternalService
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ExternalServiceId GeometryAugmentationService { get; }
```

```
Public Shared ReadOnly Property GeometryAugmentationService As ExternalServiceId
	Get
```

```
public:
static property ExternalServiceId^ GeometryAugmentationService {
	ExternalServiceId^ get ();
}
```

```
static member GeometryAugmentationService : ExternalServiceId with get
```

#### Property Value

ExternalServiceId See Also

#### Reference

ExternalServices BuiltInExternalServices Class Autodesk.Revit.DB.ExternalService Namespace